app/views/statistics/fill_out_form.html.haml

SELECT "factors".* FROM "factors" WHERE "factors"."statistic_id" = ?  [["statistic_id", 1]]
---
    = stat.description
    - stat.factors.each do |factor|