app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers"
---
  def index
    @answers = Answer.all

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_answer
      @answer = Answer.find(params[:id])