app/controllers/factors_controller.rb

  def index
    @factors = Factor.all
---
SELECT "factors".* FROM "factors"