app/controllers/statistics_controller.rb

SELECT "statistics".* FROM "statistics"
---
  def index
    @statistics = Statistic.all

INSERT INTO "statistics" ("created_at", "description", "equation", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 05 Mar 2014 07:45:21 UTC +00:00], ["description", "Car Emissions"], ["equation", "m*cpm"], ["updated_at", Wed, 05 Mar 2014 07:45:21 UTC +00:00]]
---
  def create
    if Statistic.IsValidEquation(statistic_params[:equation])
      @statistic = Statistic.new(statistic_params)
      respond_to do |format|
        if @statistic.save

DELETE FROM "statistics" WHERE "statistics"."id" = ?  [["id", 1]]
SELECT "factors".* FROM "factors" WHERE "factors"."statistic_id" = 1
---
  def destroy
    @statistic.destroy
    Factor.where(:statistic_id => @statistic.id).each do |s|

SELECT "factors".* FROM "factors" WHERE "factors"."statistic_id" = 1
---
  def fill_in_factors
    a = params[:format]
    @factors = Factor.where(:statistic_id => a)

SELECT "statistics".* FROM "statistics" WHERE "statistics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("amount", "created_at", "name", "statistic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 123.0], ["created_at", Sat, 15 Mar 2014 16:56:18 UTC +00:00], ["name", "A"], ["statistic_id", 1], ["updated_at", Sat, 15 Mar 2014 16:56:18 UTC +00:00], ["user_id", 4]]
---
  def create_answer
    current_stat_id = nil
    params[:form_fields].each do |field|
      current_stat_id = field[0][0] if current_stat_id != field[0][0]
      s = Statistic.find(field[0][0])
      Answer.where(statistic_id: s.id, user_id: current_user.id, name: field[0][1..-1], amount: field[1]).create

SELECT "statistics".* FROM "statistics"
---
  def fill_out_form
    @statistics = Statistic.all

SELECT "statistics".* FROM "statistics" WHERE "statistics"."id" = ? LIMIT 1  [["id", "1"]]
---
 def set_statistic
      @statistic = Statistic.find(params[:id])