app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "firstName" = ?, "zip" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["firstName", "Justin1"], ["zip", 871101], ["updated_at", Sat, 15 Mar 2014 18:40:39 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user].permit(:role_ids, :email, :firstName, :lastName, :state))

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    user = User.find(params[:id])
    unless user == current_user
      user.destroy